123.md

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://localhost:8080/soap">
  <soapenv:Header/>
  <soapenv:Body>
    <web:getAllMessages/>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://localhost:8080/soap">
  <soapenv:Header/>
  <soapenv:Body>
    <web:createMessage>
      <content>Новое сообщение</content>
    </web:createMessage>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://localhost:8080/soap">
  <soapenv:Header/>
  <soapenv:Body>
    <web:updateMessage>
      <id>1</id>
      <content>Обновленное сообщение</content>
    </web:updateMessage>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://localhost:8080/soap">
  <soapenv:Header/>
  <soapenv:Body>
    <web:deleteMessage>
      <id>1</id>
    </web:deleteMessage>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://localhost:8080/soap">
  <soapenv:Header/>
  <soapenv:Body>
    <web:updateMessage>
      <id>1</id>
      <content>Обновленное сообщение</content>
    </web:updateMessage>
  </soapenv:Body>
</soapenv:Envelope>